In [1]:
5+2

7

In [15]:
data={
    'Name' : ['Rubal','Sohan','Shyama'],
    'rol' :[121,122,123],
    'addres' :['Rual nagar','Sohan nagar','Shyama nagar']
    }
import pandas as pd
new=pd.DataFrame.from_dict(data)
new

     Name  rol        addres
0   Rubal  121    Rual nagar
1   Sohan  122   Sohan nagar
2  Shyama  123  Shyama nagar

In [18]:
new.head(-1)

    Name  rol       addres
0  Rubal  121   Rual nagar
1  Sohan  122  Sohan nagar

In [20]:
df=pd.DataFrame(data)
df

     Name  rol        addres
0   Rubal  121    Rual nagar
1   Sohan  122   Sohan nagar
2  Shyama  123  Shyama nagar

In [37]:
df.loc[(df.rol ==123)&(df.Name=='Rubal')]

Empty DataFrame
Columns: [Name, rol, addres]
Index: []

In [57]:
l=['ram','mam','check','labour']
new1=[]
c=0
for i in l:
    if str(i) !=str(i)[::-1]:
        new1.append(i)

In [66]:
def ispalidrome(i):
    return str(i) ==str(i)[::-1]

In [67]:
l=['ram','mam','check','labour']
list(filter(ispalidrome,l))

['mam']